lyq11/ESP32-Garage-Door-Control/firmware/s3_central/garage_espnow.cpp
#include "garage_espnow.h"

#include <Preferences.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_system.h>

#include "app_config.h"
#include "logger.h"
#include "rs485_modbus.h"

static const uint32_t GARAGE_MAGIC = 0x47415231; // GAR1
static const uint8_t GARAGE_CMD_TRIGGER = 1;
static const uint8_t GARAGE_RECORD_CAPACITY = 30;
static const GarageTimingConfig GARAGE_DEFAULT_TIMING = {
  5000,   // sendCooldownMs
  45,     // openStableSeconds
  5000,   // openRecheckMs
  10000,  // movingRecheckMs
  45000,  // postTriggerRecheckMs
  60000,  // maxAttemptRecheckMs
  3       // maxAutoCloseAttempts
};

struct GarageCommandPacket {
  uint32_t magic;
  uint8_t version;
  uint8_t command;
  uint16_t userId;
  uint32_t seq;
  uint32_t millisStamp;
  uint32_t signature;
};

struct GarageAckPacket {
  uint32_t magic;
  uint32_t seq;
  uint8_t ok;
  uint8_t state;
};

struct GarageRecord {
  uint32_t timeMs;
  uint32_t seq;
  int userId;
  bool sent;
  bool ackOk;
  GarageDoorState doorState;
  char source[18];
  char reason[40];
};

enum GarageLogicStage {
  GARAGE_STAGE_IDLE,
  GARAGE_STAGE_OPEN_WAIT,
  GARAGE_STAGE_MOVING_WAIT
};

static bool espNowReady = false;
static bool garageEnabled = false;
static bool autoCloseEnabled = true;
static GarageTimingConfig timingConfig = GARAGE_DEFAULT_TIMING;
static bool peerConfigured = false;
static uint8_t peerMac[6] = {0};
static String peerMacText;
static String sharedSecret = "garage-secret";
static uint32_t seqNo = 0;
static uint32_t lastSendMs = 0;
static uint32_t lastAckMs = 0;
static uint32_t lastAckSeq = 0;
static bool lastSendOk = false;
static bool lastAckOk = false;
static String lastReason;
static String lastTriggerSource;
static String lastTriggerReason;
static int lastTriggerUserId = -1;
static GarageLogicStage logicStage = GARAGE_STAGE_IDLE;
static uint32_t nextLogicMs = 0;
static uint8_t autoCloseAttempts = 0;
static bool autoCloseMaxLogged = false;
static GarageRecord records[GARAGE_RECORD_CAPACITY];
static uint8_t recordHead = 0;
static uint8_t recordCount = 0;
static const uint32_t DUAL_LIMIT_STOPPED_GRACE_MS = 3000;

enum GarageMotionDirection {
  GARAGE_DIRECTION_UNKNOWN,
  GARAGE_DIRECTION_OPENING,
  GARAGE_DIRECTION_CLOSING
};

static GarageDoorState lastEndpointState = GARAGE_DOOR_UNKNOWN;
static GarageDoorState lastComputedDoorState = GARAGE_DOOR_UNKNOWN;
static GarageMotionDirection motionDirection = GARAGE_DIRECTION_UNKNOWN;
static uint32_t dualTravelStartMs = 0;
static DoorLimitMode trackedLimitMode = DOOR_LIMIT_SINGLE;
static uint8_t trackedSinglePort = 1;

static const char *motionDirectionText(GarageMotionDirection direction) {
  switch (direction) {
    case GARAGE_DIRECTION_OPENING:
      return "OPENING";
    case GARAGE_DIRECTION_CLOSING:
      return "CLOSING";
    default:
      return "UNKNOWN";
  }
}

const char *garageMotionDirectionText() {
  return motionDirectionText(motionDirection);
}

static uint32_t fnv1a(const uint8_t *data, size_t len, uint32_t hash = 2166136261UL) {
  for (size_t i = 0; i < len; i++) {
    hash ^= data[i];
    hash *= 16777619UL;
  }
  return hash;
}

static uint32_t packetSignature(const GarageCommandPacket &packet) {
  uint32_t hash = fnv1a((const uint8_t *)sharedSecret.c_str(), sharedSecret.length());
  hash = fnv1a((const uint8_t *)&packet.magic, sizeof(packet.magic), hash);
  hash = fnv1a((const uint8_t *)&packet.version, sizeof(packet.version), hash);
  hash = fnv1a((const uint8_t *)&packet.command, sizeof(packet.command), hash);
  hash = fnv1a((const uint8_t *)&packet.userId, sizeof(packet.userId), hash);
  hash = fnv1a((const uint8_t *)&packet.seq, sizeof(packet.seq), hash);
  hash = fnv1a((const uint8_t *)&packet.millisStamp, sizeof(packet.millisStamp), hash);
  return hash;
}

static bool parseMac(const String &text, uint8_t out[6]) {
  int values[6];
  if (sscanf(text.c_str(), "%x:%x:%x:%x:%x:%x",
             &values[0], &values[1], &values[2], &values[3], &values[4], &values[5]) != 6) {
    return false;
  }
  for (uint8_t i = 0; i < 6; i++) {
    if (values[i] < 0 || values[i] > 255) {
      return false;
    }
    out[i] = (uint8_t)values[i];
  }
  return true;
}

static String macToString(const uint8_t mac[6]) {
  char buf[18];
  snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(buf);
}

static String escapeJson(const String &value) {
  String out;
  out.reserve(value.length() + 8);
  for (size_t i = 0; i < value.length(); i++) {
    char c = value[i];
    if (c == '"' || c == '\\') {
      out += '\\';
      out += c;
    } else if (c == '\n') {
      out += "\\n";
    } else if (c == '\r') {
      out += "\\r";
    } else {
      out += c;
    }
  }
  return out;
}

static void addRecord(const char *source, const char *reason, int userId,
                      GarageDoorState state, bool sent, uint32_t seq = 0) {
  GarageRecord &record = records[recordHead];
  record.timeMs = millis();
  record.seq = seq;
  record.userId = userId;
  record.sent = sent;
  record.ackOk = false;
  record.doorState = state;
  snprintf(record.source, sizeof(record.source), "%s", source ? source : "");
  snprintf(record.reason, sizeof(record.reason), "%s", reason ? reason : "");
  recordHead = (recordHead + 1) % GARAGE_RECORD_CAPACITY;
  if (recordCount < GARAGE_RECORD_CAPACITY) {
    recordCount++;
  }
}

static void persistSeqNo() {
  Preferences prefs;
  prefs.begin("garage", false);
  prefs.putUInt("seqNo", seqNo);
  prefs.end();
}

static void markRecordAck(uint32_t seq, bool ok) {
  for (uint8_t i = 0; i < recordCount; i++) {
    uint8_t index = (recordHead + GARAGE_RECORD_CAPACITY - 1 - i) % GARAGE_RECORD_CAPACITY;
    if (records[index].seq == seq) {
      records[index].ackOk = ok;
      return;
    }
  }
}

const char *garageDoorStateText(GarageDoorState state) {
  switch (state) {
    case GARAGE_DOOR_CLOSED:
      return "CLOSED";
    case GARAGE_DOOR_OPEN:
      return "OPEN";
    case GARAGE_DOOR_MOVING:
      return "MOVING";
    case GARAGE_DOOR_STOPPED:
      return "STOPPED";
    case GARAGE_DOOR_TIMEOUT:
      return "TIMEOUT";
    case GARAGE_DOOR_CONFLICT:
      return "CONFLICT";
    default:
      return "UNKNOWN";
  }
}

GarageDoorState garageDoorState() {
  DoorLimitConfig config = rs485DoorLimitConfig();
  if (config.mode != trackedLimitMode || config.singlePort != trackedSinglePort) {
    trackedLimitMode = config.mode;
    trackedSinglePort = config.singlePort;
    lastEndpointState = GARAGE_DOOR_UNKNOWN;
    lastComputedDoorState = GARAGE_DOOR_UNKNOWN;
    motionDirection = GARAGE_DIRECTION_UNKNOWN;
    dualTravelStartMs = 0;
  }

  if (config.mode == DOOR_LIMIT_SINGLE) {
    Rs485Port &doorPort = rs485Ports[config.singlePort];
    if (!doorPort.lastReadOk) {
      lastComputedDoorState = GARAGE_DOOR_UNKNOWN;
    } else if (doorPort.regs[DOOR_VIBRATION_REG_INDEX] != 0) {
      lastComputedDoorState = GARAGE_DOOR_MOVING;
    } else if (doorPort.regs[DOOR_HALL_REG_INDEX] == 1) {
      lastComputedDoorState = GARAGE_DOOR_CLOSED;
    } else {
      lastComputedDoorState = GARAGE_DOOR_OPEN;
    }
    return lastComputedDoorState;
  }

  Rs485Port &upperPort = rs485Ports[0];
  Rs485Port &lowerPort = rs485Ports[1];
  if (!upperPort.lastReadOk || !lowerPort.lastReadOk) {
    lastComputedDoorState = GARAGE_DOOR_UNKNOWN;
    return lastComputedDoorState;
  }

  bool upperActive = upperPort.regs[DOOR_HALL_REG_INDEX] == 1;
  bool lowerActive = lowerPort.regs[DOOR_HALL_REG_INDEX] == 1;
  if (upperActive && lowerActive) {
    motionDirection = GARAGE_DIRECTION_UNKNOWN;
    dualTravelStartMs = 0;
    lastComputedDoorState = GARAGE_DOOR_CONFLICT;
    return lastComputedDoorState;
  }
  if (upperActive) {
    lastEndpointState = GARAGE_DOOR_OPEN;
    lastComputedDoorState = GARAGE_DOOR_OPEN;
    motionDirection = GARAGE_DIRECTION_UNKNOWN;
    dualTravelStartMs = 0;
    return lastComputedDoorState;
  }
  if (lowerActive) {
    lastEndpointState = GARAGE_DOOR_CLOSED;
    lastComputedDoorState = GARAGE_DOOR_CLOSED;
    motionDirection = GARAGE_DIRECTION_UNKNOWN;
    dualTravelStartMs = 0;
    return lastComputedDoorState;
  }

