lyq11/ESP32-Garage-Door-Control/firmware/s3_central/garage_espnow.cpp
  if (dualTravelStartMs == 0) {
    dualTravelStartMs = millis();
    if (lastEndpointState == GARAGE_DOOR_CLOSED) {
      motionDirection = GARAGE_DIRECTION_OPENING;
    } else if (lastEndpointState == GARAGE_DOOR_OPEN) {
      motionDirection = GARAGE_DIRECTION_CLOSING;
    } else {
      motionDirection = GARAGE_DIRECTION_UNKNOWN;
    }
  }

  uint32_t travelMs = millis() - dualTravelStartMs;
  if (travelMs >= (uint32_t)config.travelTimeoutSeconds * 1000UL) {
    lastComputedDoorState = GARAGE_DOOR_TIMEOUT;
  } else if (upperPort.regs[DOOR_VIBRATION_REG_INDEX] != 0 ||
             lowerPort.regs[DOOR_VIBRATION_REG_INDEX] != 0 ||
             travelMs < DUAL_LIMIT_STOPPED_GRACE_MS) {
    lastComputedDoorState = GARAGE_DOOR_MOVING;
  } else {
    lastComputedDoorState = GARAGE_DOOR_STOPPED;
  }
  return lastComputedDoorState;
}

uint16_t garageDoorStateDurationSeconds() {
  DoorLimitConfig config = rs485DoorLimitConfig();
  GarageDoorState state = garageDoorState();
  if (config.mode == DOOR_LIMIT_SINGLE) {
    Rs485Port &doorPort = rs485Ports[config.singlePort];
    return doorPort.lastReadOk ? doorPort.regs[STATE_DURATION_REG_INDEX] : 0;
  }
  if (state == GARAGE_DOOR_OPEN) {
    return rs485Ports[0].regs[STATE_DURATION_REG_INDEX];
  }
  if (state == GARAGE_DOOR_CLOSED) {
    return rs485Ports[1].regs[STATE_DURATION_REG_INDEX];
  }
  if (dualTravelStartMs == 0) {
    return 0;
  }
  uint32_t seconds = (millis() - dualTravelStartMs) / 1000UL;
  return seconds > 65535UL ? 65535 : (uint16_t)seconds;
}

String garageLastTriggerMethod(uint32_t maxAgeMs) {
  if (lastSendMs == 0 || millis() - lastSendMs > maxAgeMs) {
    return F("手动/外部按钮（未检测到近期中控指令）");
  }
  if (lastTriggerReason == "manual_api") {
    return F("Web/API 手动开门");
  }
  if (lastTriggerReason == "auto_close_open_timeout") {
    return F("自动关门指令后仍处于开启状态");
  }

  String method;
  if (lastTriggerSource == "FACE_OK") {
    method = F("人脸识别");
  } else if (lastTriggerSource == "FACE_EYE_CLOSED_OK") {
    method = F("人脸识别（闭眼通过）");
  } else if (lastTriggerSource == "HAND_OK") {
    method = F("掌静脉识别");
  } else {
    method = lastTriggerSource.length() ? lastTriggerSource : String(F("中控指令"));
  }
  if (lastTriggerReason.length()) {
    method += F("，人员=");
    method += lastTriggerReason;
  }
  if (lastTriggerUserId >= 0) {
    method += F("，用户ID=");
    method += lastTriggerUserId;
  }
  return method;
}

bool garageRecentlyTriggered(uint32_t windowMs) {
  return lastSendMs != 0 && millis() - lastSendMs < windowMs;
}

GarageTimingConfig garageTiming() {
  return timingConfig;
}

#if ESP_ARDUINO_VERSION_MAJOR >= 3
static void onEspNowSent(const wifi_tx_info_t *txInfo, esp_now_send_status_t status) {
  (void)txInfo;
#else
static void onEspNowSent(const uint8_t *macAddr, esp_now_send_status_t status) {
  (void)macAddr;
#endif
  lastSendOk = status == ESP_NOW_SEND_SUCCESS;
}

#if ESP_ARDUINO_VERSION_MAJOR >= 3
static void onEspNowRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
  (void)info;
#else
static void onEspNowRecv(const uint8_t *macAddr, const uint8_t *data, int len) {
  (void)macAddr;
#endif
  if (len != sizeof(GarageAckPacket)) {
    return;
  }
  GarageAckPacket ack;
  memcpy(&ack, data, sizeof(ack));
  if (ack.magic != GARAGE_MAGIC) {
    return;
  }
  lastAckMs = millis();
  lastAckSeq = ack.seq;
  lastAckOk = ack.ok != 0;
  markRecordAck(ack.seq, lastAckOk);
  logInfo("GARAGE", "ack seq=" + String(ack.seq) + " ok=" + String(lastAckOk ? "true" : "false"));
}

static bool addPeer() {
  if (!peerConfigured || !espNowReady) {
    return false;
  }
  esp_now_del_peer(peerMac);
  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, peerMac, 6);
  peerInfo.channel = WiFi.channel();
  peerInfo.encrypt = false;
  esp_err_t err = esp_now_add_peer(&peerInfo);
  if (err != ESP_OK) {
    logError("GARAGE", "esp_now_add_peer failed err=" + String((int)err));
    return false;
  }
  logInfo("GARAGE", "peer added mac=" + peerMacText + " channel=" + String(WiFi.channel()));
  return true;
}

void garageRefreshPeerAfterWifiReconnect() {
  if (!espNowReady || !peerConfigured) {
    return;
  }
  if (!addPeer()) {
    logWarn("GARAGE", "peer refresh after WiFi reconnect failed");
  }
}

static bool garageTriggerFrom(uint8_t command, const char *reason, int userId, const char *source) {
  GarageDoorState state = garageDoorState();
  if (!garageEnabled || !peerConfigured || !espNowReady) {
    logWarn("GARAGE", "trigger skipped, not configured");
    addRecord(source, "not_configured", userId, state, false);
    return false;
  }
  if (millis() - lastSendMs < timingConfig.sendCooldownMs) {
    logWarn("GARAGE", "trigger skipped by cooldown");
    addRecord(source, "cooldown", userId, state, false);
    return false;
  }

  GarageCommandPacket packet = {};
  packet.magic = GARAGE_MAGIC;
  packet.version = 1;
  packet.command = command;
  packet.userId = userId < 0 ? 0xFFFF : (uint16_t)userId;
  packet.seq = ++seqNo;
  persistSeqNo();
  packet.millisStamp = millis();
  packet.signature = packetSignature(packet);

  esp_err_t err = esp_now_send(peerMac, (const uint8_t *)&packet, sizeof(packet));
  lastSendMs = millis();
  lastReason = reason ? reason : "";
  if (err != ESP_OK) {
    logError("GARAGE", "send failed err=" + String((int)err));
    addRecord(source, "send_failed", userId, state, false, packet.seq);
    return false;
  }
  lastTriggerSource = source ? source : "";
  lastTriggerReason = reason ? reason : "";
  lastTriggerUserId = userId;
  addRecord(source, reason ? reason : "sent", userId, state, true, packet.seq);
  logInfo("GARAGE", "trigger sent seq=" + String(packet.seq) +
                      " userId=" + String(userId) +
                      " reason=" + lastReason);
  return true;
}

bool garageTrigger(uint8_t command, const char *reason, int userId) {
  return garageTriggerFrom(command, reason, userId, "trigger");
}

void garageOnFaceSuccess(int userId, const char *name, const char *verifyType) {
  const char *source = verifyType && verifyType[0] ? verifyType : "FACE_OK";
  rs485RefreshDoorState();
  GarageDoorState state = garageDoorState();
  if (state == GARAGE_DOOR_OPEN || state == GARAGE_DOOR_MOVING ||
      state == GARAGE_DOOR_STOPPED || state == GARAGE_DOOR_TIMEOUT) {
    logWarn("GARAGE", String(source) + " ignored, door state=" + String(garageDoorStateText(state)));
    addRecord(source, "door_not_closed", userId, state, false);
    return;
  }
  if (state != GARAGE_DOOR_CLOSED) {
    logWarn("GARAGE", String(source) + " unsafe, door state=" + String(garageDoorStateText(state)));
    addRecord(source, "unsafe_door_state", userId, state, false);
    return;
  }
  garageTriggerFrom(GARAGE_CMD_TRIGGER, name && name[0] ? name : source, userId, source);
}

static void tickAutoClose() {
  if (!autoCloseEnabled) {
    logicStage = GARAGE_STAGE_IDLE;
    return;
  }

