lyq11/ESP32-Garage-Door-Control/firmware/s3_central/garage_espnow.cpp
  GarageDoorState state = garageDoorState();
  uint32_t now = millis();

  if (logicStage == GARAGE_STAGE_IDLE) {
    if (state == GARAGE_DOOR_OPEN) {
      logicStage = GARAGE_STAGE_OPEN_WAIT;
      nextLogicMs = now + timingConfig.openRecheckMs;
      autoCloseAttempts = 0;
      autoCloseMaxLogged = false;
      logInfo("GARAGE", "door open detected, wait for stable open");
    }
    return;
  }

  if (now < nextLogicMs) {
    if (state == GARAGE_DOOR_CLOSED) {
      logicStage = GARAGE_STAGE_IDLE;
      autoCloseAttempts = 0;
      autoCloseMaxLogged = false;
      logInfo("GARAGE", "door closed, auto close idle");
    }
    return;
  }

  if (state == GARAGE_DOOR_CLOSED) {
    logicStage = GARAGE_STAGE_IDLE;
    autoCloseAttempts = 0;
    autoCloseMaxLogged = false;
    logInfo("GARAGE", "door closed, no action");
    return;
  }

  if (state == GARAGE_DOOR_MOVING || state == GARAGE_DOOR_STOPPED ||
      state == GARAGE_DOOR_TIMEOUT || state == GARAGE_DOOR_UNKNOWN) {
    logicStage = GARAGE_STAGE_MOVING_WAIT;
    nextLogicMs = now + timingConfig.movingRecheckMs;
    logInfo("GARAGE", "door state=" + String(garageDoorStateText(state)) +
                        ", recheck in " + String(timingConfig.movingRecheckMs / 1000) + "s");
    return;
  }

  if (state == GARAGE_DOOR_OPEN) {
    uint16_t openSeconds = garageDoorStateDurationSeconds();
    if (openSeconds < timingConfig.openStableSeconds) {
      logicStage = GARAGE_STAGE_OPEN_WAIT;
      nextLogicMs = now + timingConfig.openRecheckMs;
      logInfo("GARAGE", "door open stable wait " + String(openSeconds) +
                          "/" + String(timingConfig.openStableSeconds) + "s");
      return;
    }
    if (autoCloseAttempts >= timingConfig.maxAutoCloseAttempts) {
      if (!autoCloseMaxLogged) {
        logError("GARAGE", "auto close max attempts reached");
        autoCloseMaxLogged = true;
      }
      logicStage = GARAGE_STAGE_MOVING_WAIT;
      nextLogicMs = now + timingConfig.maxAttemptRecheckMs;
      return;
    }
    autoCloseAttempts++;
    garageTrigger(GARAGE_CMD_TRIGGER, "auto_close_open_timeout", -1);
    logicStage = GARAGE_STAGE_MOVING_WAIT;
    nextLogicMs = now + timingConfig.postTriggerRecheckMs;
    return;
  }

  if (state == GARAGE_DOOR_CONFLICT) {
    logError("GARAGE", "door sensor conflict");
    logicStage = GARAGE_STAGE_MOVING_WAIT;
    nextLogicMs = now + timingConfig.movingRecheckMs;
  }
}

bool garageConfigure(const String &mac, const String &secret, bool enabled, bool autoClose,
                     const GarageTimingConfig &timing) {
  uint8_t parsed[6];
  if (enabled && !parseMac(mac, parsed)) {
    return false;
  }

  Preferences prefs;
  prefs.begin("garage", false);
  prefs.putBool("enabled", enabled);
  prefs.putBool("autoClose", autoClose);
  prefs.putString("mac", mac);
  prefs.putString("secret", secret);
  prefs.putUInt("sendCd", timing.sendCooldownMs);
  prefs.putUShort("openStable", timing.openStableSeconds);
  prefs.putUInt("openChk", timing.openRecheckMs);
  prefs.putUInt("movingChk", timing.movingRecheckMs);
  prefs.putUInt("postTrig", timing.postTriggerRecheckMs);
  prefs.putUInt("maxChk", timing.maxAttemptRecheckMs);
  prefs.putUChar("maxAtt", timing.maxAutoCloseAttempts);
  prefs.end();

  garageEnabled = enabled;
  autoCloseEnabled = autoClose;
  timingConfig = timing;
  sharedSecret = secret.length() ? secret : "garage-secret";
  peerConfigured = enabled;
  if (enabled) {
    memcpy(peerMac, parsed, 6);
    peerMacText = macToString(peerMac);
    addPeer();
  }
  logInfo("GARAGE", "config saved enabled=" + String(enabled ? "true" : "false") +
                      " autoClose=" + String(autoClose ? "true" : "false") +
                      " openStable=" + String(timingConfig.openStableSeconds) + "s");
  return true;
}

void garageBegin() {
  Preferences prefs;
  prefs.begin("garage", true);
  garageEnabled = prefs.getBool("enabled", false);
  autoCloseEnabled = prefs.getBool("autoClose", true);
  peerMacText = prefs.getString("mac", "");
  sharedSecret = prefs.getString("secret", "garage-secret");
  timingConfig.sendCooldownMs = prefs.getUInt("sendCd", GARAGE_DEFAULT_TIMING.sendCooldownMs);
  timingConfig.openStableSeconds = prefs.getUShort("openStable", GARAGE_DEFAULT_TIMING.openStableSeconds);
  timingConfig.openRecheckMs = prefs.getUInt("openChk", GARAGE_DEFAULT_TIMING.openRecheckMs);
  timingConfig.movingRecheckMs = prefs.getUInt("movingChk", GARAGE_DEFAULT_TIMING.movingRecheckMs);
  timingConfig.postTriggerRecheckMs = prefs.getUInt("postTrig", GARAGE_DEFAULT_TIMING.postTriggerRecheckMs);
  timingConfig.maxAttemptRecheckMs = prefs.getUInt("maxChk", GARAGE_DEFAULT_TIMING.maxAttemptRecheckMs);
  timingConfig.maxAutoCloseAttempts = prefs.getUChar("maxAtt", GARAGE_DEFAULT_TIMING.maxAutoCloseAttempts);
  seqNo = prefs.getUInt("seqNo", 0);
  prefs.end();
  if (seqNo == 0) {
    seqNo = 100000UL + (esp_random() & 0x3FFFFFFFUL);
    persistSeqNo();
  }
  peerConfigured = garageEnabled && parseMac(peerMacText, peerMac);
  if (peerConfigured) {
    peerMacText = macToString(peerMac);
  }

  if (esp_now_init() != ESP_OK) {
    logError("GARAGE", "esp_now_init failed");
    return;
  }
  espNowReady = true;
  esp_now_register_send_cb(onEspNowSent);
  esp_now_register_recv_cb(onEspNowRecv);
  addPeer();
  logInfo("GARAGE", "esp-now ready enabled=" + String(garageEnabled ? "true" : "false") +
                      " channel=" + String(WiFi.channel()) +
                      " seqNo=" + String(seqNo));
}

void garageTick() {
  tickAutoClose();
}

String garageStatusJson() {
  GarageDoorState state = garageDoorState();
  DoorLimitConfig limitConfig = rs485DoorLimitConfig();
  String json = F("{\"enabled\":");
  json += garageEnabled ? F("true") : F("false");
  json += F(",\"espNowReady\":");
  json += espNowReady ? F("true") : F("false");
  json += F(",\"peerConfigured\":");
  json += peerConfigured ? F("true") : F("false");
  json += F(",\"peerMac\":\"");
  json += peerMacText;
  json += F("\",\"channel\":");
  json += WiFi.channel();
  json += F(",\"autoCloseEnabled\":");
  json += autoCloseEnabled ? F("true") : F("false");
  json += F(",\"limitMode\":\"");
  json += rs485DoorLimitModeText(limitConfig.mode);
  json += F("\",\"singleLimitPort\":");
  json += limitConfig.singlePort;
  json += F(",\"upperLimitActive\":");
  json += (rs485Ports[0].lastReadOk && rs485Ports[0].regs[DOOR_HALL_REG_INDEX] == 1) ? F("true") : F("false");
  json += F(",\"lowerLimitActive\":");
  json += (rs485Ports[1].lastReadOk && rs485Ports[1].regs[DOOR_HALL_REG_INDEX] == 1) ? F("true") : F("false");
  json += F(",\"motionDirection\":\"");
  json += motionDirectionText(motionDirection);
  json += F("\",\"travelElapsedSeconds\":");
  json += (limitConfig.mode == DOOR_LIMIT_DUAL && dualTravelStartMs != 0)
              ? (millis() - dualTravelStartMs) / 1000UL
              : 0;
  json += F(",\"travelTimeoutSeconds\":");
  json += limitConfig.travelTimeoutSeconds;
  json += F(",\"travelTimedOut\":");
  json += state == GARAGE_DOOR_TIMEOUT ? F("true") : F("false");
  json += F(",\"sendCooldownMs\":");
  json += timingConfig.sendCooldownMs;
  json += F(",\"openStableSeconds\":");
  json += timingConfig.openStableSeconds;
  json += F(",\"openRecheckMs\":");
  json += timingConfig.openRecheckMs;
  json += F(",\"movingRecheckMs\":");
  json += timingConfig.movingRecheckMs;
  json += F(",\"postTriggerRecheckMs\":");
  json += timingConfig.postTriggerRecheckMs;
  json += F(",\"maxAttemptRecheckMs\":");
  json += timingConfig.maxAttemptRecheckMs;
  json += F(",\"maxAutoCloseAttempts\":");
  json += timingConfig.maxAutoCloseAttempts;
  json += F(",\"doorState\":\"");
  json += garageDoorStateText(state);
  json += F("\",\"logicStage\":");
  json += (int)logicStage;
  json += F(",\"nextLogicMs\":");
  json += nextLogicMs;
  json += F(",\"autoCloseAttempts\":");
  json += autoCloseAttempts;
  json += F(",\"lastSendMs\":");
  json += lastSendMs;
  json += F(",\"lastSendOk\":");
  json += lastSendOk ? F("true") : F("false");
  json += F(",\"lastAckMs\":");
  json += lastAckMs;
  json += F(",\"lastAckSeq\":");
  json += lastAckSeq;
  json += F(",\"lastAckOk\":");
  json += lastAckOk ? F("true") : F("false");
  json += F(",\"lastReason\":\"");
  json += lastReason;
  json += F("\"}");
  return json;
}

String garageRecordsJson() {
  String json = F("{\"records\":[");
  for (uint8_t i = 0; i < recordCount; i++) {
    uint8_t index = (recordHead + GARAGE_RECORD_CAPACITY - 1 - i) % GARAGE_RECORD_CAPACITY;
    GarageRecord &record = records[index];
    if (i > 0) {
      json += ',';
    }
    json += F("{\"time\":");
    json += record.timeMs;
    json += F(",\"seq\":");
    json += record.seq;
    json += F(",\"userId\":");
    json += record.userId;
    json += F(",\"sent\":");
    json += record.sent ? F("true") : F("false");
    json += F(",\"ackOk\":");
    json += record.ackOk ? F("true") : F("false");
    json += F(",\"doorState\":\"");
    json += garageDoorStateText(record.doorState);
    json += F("\",\"source\":\"");
    json += escapeJson(record.source);
    json += F("\",\"reason\":\"");
    json += escapeJson(record.reason);
    json += F("\"}");
  }
  json += F("]}");
  return json;
}
